modeldesigner/winery.repository.ext/src/main/webapp/components/jquery/test/data/with_fries.xml

<?xml version='1.0' encoding='UTF-8'?>
<!--

    Copyright 2016 [ZTE] and others.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.

-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<jsconf xmlns="http://example.com/ns1">
			<response xmlns:ab="http://example.com/ns2">
				<meta>
					<component id="seite1" class="component">
						<properties xmlns:cd="http://example.com/ns3">
							<property name="prop1">
								<thing />
								<value>1</value>
							</property>
							<property name="prop2">
								<thing att="something" />
							</property>
							<foo_bar>foo</foo_bar>
						</properties>
					</component>
				</meta>
			</response>
		</jsconf>
	</soap:Body>
</soap:Envelope>
